ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/TIMG12_0_1.0.xml
        <register id="TIMG12_0_GEN_EVENT1_ICLR" width="32" offset="0x28" description="Interrupt clear">
            <bitfield id="Z" description="Zero event CLEAR" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect."/>
                <bitenum id="CLR" value="0x1" description="Event Clear"/>
            </bitfield>
            <bitfield id="L" description="Load event CLEAR" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect."/>
                <bitenum id="CLR" value="0x1" description="Event Clear"/>
            </bitfield>
            <bitfield id="CCD0" description="Capture or compare down event CLEAR" begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect."/>
                <bitenum id="CLR" value="0x1" description="Event Clear"/>
            </bitfield>
            <bitfield id="CCD1" description="Capture or compare down event CLEAR" begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect."/>
                <bitenum id="CLR" value="0x1" description="Event Clear"/>
            </bitfield>
            <bitfield id="CCU0" description="Capture or compare up event CLEAR" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect."/>
                <bitenum id="CLR" value="0x1" description="Event Clear"/>
            </bitfield>
            <bitfield id="CCU1" description="Capture or compare up event CLEAR" begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect."/>
                <bitenum id="CLR" value="0x1" description="Event Clear"/>
            </bitfield>
            <bitfield id="TOV" description="Trigger Overflow event CLEAR" begin="25" end="25" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect."/>
                <bitenum id="CLR" value="0x1" description="Event Clear"/>
            </bitfield>
        </register>
        </group>
    <register id="TIMG12_0_EVT_MODE" width="32" offset="0x10E0" description="Event Mode">
        <bitfield id="EVT0_CFG" description="Event line mode select for event corresponding to CPU_INT" begin="1" end="0" width="2" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="SOFTWARE" value="0x1" description="The interrupt or event line is in software mode. Software must clear the RIS."/>
            <bitenum id="HARDWARE" value="0x2" description="The interrupt or event line is in hardware mode. The hardware (another module) clears automatically the associated RIS flag."/>
        </bitfield>
        <bitfield id="EVT1_CFG" description="Event line mode select for event corresponding to GEN_EVENT0" begin="3" end="2" width="2" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="SOFTWARE" value="0x1" description="The interrupt or event line is in software mode. Software must clear the RIS."/>
            <bitenum id="HARDWARE" value="0x2" description="The interrupt or event line is in hardware mode. The hardware (another module) clears automatically the associated RIS flag."/>
        </bitfield>
        <bitfield id="EVT2_CFG" description="Event line mode select for event corresponding to GEN_EVENT1" begin="5" end="4" width="2" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="SOFTWARE" value="0x1" description="The interrupt or event line is in software mode. Software must clear the RIS."/>
            <bitenum id="HARDWARE" value="0x2" description="The interrupt or event line is in hardware mode. The hardware (another module) clears automatically the associated RIS flag."/>
        </bitfield>
    </register>
    <register id="TIMG12_0_DESC" width="32" offset="0x10FC" description="Module Description">
        <bitfield id="MINREV" description="Minor rev of the IP" begin="3" end="0" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="MAJREV" description="Major rev of the IP" begin="7" end="4" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="INSTNUM" description="Instance Number within the device. This will be a parameter to the RTL for modules that can have multiple instances" begin="11" end="8" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="FEATUREVER" description="Feature Set for the module *instance*" begin="15" end="12" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="MODULEID" description="Module identification contains a unique peripheral identification number. The assignments are maintained in a central database for all of the platform modules to ensure uniqueness." begin="31" end="16" width="16" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFFFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <group id="TIMG12_0_COMMONREGS" name="TIMG12_0_COMMONREGS" instances="1" offset="0x1100" instaddr="0x2F" description="">
        <register id="TIMG12_0_CCPD" width="32" offset="0x0" description="CCP Direction">
            <bitfield id="C0CCP0" description="CCP0 direction" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="INPUT" value="0x0" description="Input"/>
                <bitenum id="OUTPUT" value="0x1" description="Output"/>
            </bitfield>
            <bitfield id="C0CCP1" description="CCP1 direction" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="INPUT" value="0x0" description="Input"/>
                <bitenum id="OUTPUT" value="0x1" description="Output"/>
            </bitfield>
        </register>
        <register id="TIMG12_0_ODIS" width="32" offset="0x4" description="Output Disable">
            <bitfield id="C0CCP0" description="Counter CCP0 Disable Mask
Defines whether CCP0 of Counter n is forced low or not" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CCP_OUTPUT_OCTL" value="0x0" description="Output function as selected by the OCTL register CCPO field are provided to output inversion block."/>
                <bitenum id="CCP_OUTPUT_LOW" value="0x1" description="CCP output occpout[0] is forced low."/>
            </bitfield>
            <bitfield id="C0CCP1" description="Counter CCP1 Disable Mask
Defines whether CCP0 of Counter n is forced low or not" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CCP_OUTPUT_OCTL" value="0x0" description="Output function as selected by the OCTL register CCPO field are provided to output inversion block."/>
                <bitenum id="CCP_OUTPUT_LOW" value="0x1" description="CCP output occpout[1] is forced low."/>
            </bitfield>
        </register>
        <register id="TIMG12_0_CCLKCTL" width="32" offset="0x8" description="Counter Clock Control Register">
            <bitfield id="CLKEN" description="Clock Enable
Disables the clock gating to the module. SW has to explicitly program the value
 to 0 to gate the clock." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="Clock is disabled."/>
                <bitenum id="ENABLED" value="0x1" description="Clock is enabled"/>
            </bitfield>
        </register>
